Revit 2025 API
ParameterFilterRuleFactory.CreateNotBeginsWithRule Method
Overload List
Name | Description
CreateNotBeginsWithRule(ElementId, String) |  Creates a filter rule that determines whether strings from the document do not begin with a certain string value.
CreateNotBeginsWithRule(ElementId, String, Boolean) | Obsolete.
 Creates a filter rule that determines whether strings from the document do not begin with a certain string value.
Top
See Also
Reference
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace